       IDENTIFICATION DIVISION.
       PROGRAM-ID. raindrops.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUMBER PIC 9(4).
       01 WS-RESULT PIC X(20).
       01 WS-SOUNDS.
          02 WS-SOUND PIC X(5) OCCURS 3 TIMES.
       PROCEDURE DIVISION.
       RAINDROPS.

       MOVE '' TO WS-SOUNDS
       MOVE '' TO WS-RESULT
       IF FUNCTION MOD(WS-NUMBER, 3) = 0 THEN
           MOVE 'Pling' TO WS-SOUND(1)
       END-IF

       IF FUNCTION MOD(WS-NUMBER, 5) = 0 THEN
           MOVE 'Plang' TO WS-SOUND(2)
       END-IF

       IF FUNCTION MOD(WS-NUMBER, 7) = 0 THEN
           MOVE 'Plong' TO WS-SOUND(3)
       END-IF

       MOVE FUNCTION TRIM(WS-SOUNDS) TO WS-RESULT

       IF WS-RESULT = '' THEN MOVE WS-NUMBER TO WS-RESULT
