       IDENTIFICATION DIVISION.
       PROGRAM-ID. DARTS.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-X PIC 99V9.
       01 WS-Y PIC 99V9.
       01 WS-RESULT PIC 99.
       01 WS-SPOT PIC 999v9.
       PROCEDURE DIVISION.
       DARTS.

       MOVE 0 TO WS-RESULT
       COMPUTE WS-SPOT = WS-X ** 2 + WS-Y ** 2

       EVALUATE TRUE
           WHEN WS-SPOT <=  1 ** 2 MOVE 10 TO WS-RESULT
           WHEN WS-SPOT <=  5 ** 2 MOVE  5 TO WS-RESULT
           WHEN WS-SPOT <= 10 ** 2 MOVE  1 TO WS-RESULT
       END-EVALUATE
