        IDENTIFICATION DIVISION.
        PROGRAM-ID. PANGRAM.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-SENTENCE  PIC X(60).
        01 WS-RESULT    PIC 9.
        01 WS-ALPHA.
           02 WS-LETTER PIC X(1) OCCURS 26 TIMES.
        01 WS-STRING    PIC X(60).
        01 WS-COUNT     PIC 9(2).
        01 WS-TMP       PIC 9(2).
        01 I            PIC 9(2).
        PROCEDURE DIVISION.
        PANGRAM.

        MOVE 'ABCDEFGHIJKLMNOPQRSTUVWXYZ' TO WS-ALPHA
        MOVE FUNCTION UPPER-CASE (WS-SENTENCE) TO WS-STRING

        MOVE 0 TO WS-RESULT
        MOVE 0 TO WS-COUNT
        MOVE 1 TO I
        PERFORM UNTIL I >= 27
            MOVE 0 TO WS-TMP
            INSPECT WS-STRING TALLYING WS-TMP FOR ALL WS-LETTER(I)
            IF WS-TMP > 0 THEN ADD 1 TO WS-COUNT END-IF
            ADD 1 TO I
        END-PERFORM

        IF WS-COUNT = 26 THEN MOVE 1 TO WS-RESULT END-IF

        CONTINUE.
        PANGRAM-EXIT.
        EXIT.
